Revit 2026 API

# HorizontalAlignmentStyle Enumeration

---

Declares the horizontal alignment style of font.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HorizontalAlignmentStyle
```
```vb
Public Enumeration HorizontalAlignmentStyle
```
```cpp
public enum class HorizontalAlignmentStyle
```
```fsharp
type HorizontalAlignmentStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 1 | Alignment to center |
| Left | 0 | Alignment to left |
| Right | 2 | Alignment to right |

#### Reference

Autodesk.Revit.DB Namespace